identification.org
#+TITLE: Identification of the Stewart Platform using Simscape
:DRAWER:
#+STARTUP: overview

#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="css/htmlize.css"/>
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="css/readtheorg.css"/>
#+HTML_HEAD: <script src="js/jquery.min.js"></script>
#+HTML_HEAD: <script src="js/bootstrap.min.js"></script>
#+HTML_HEAD: <script type="text/javascript" src="js/jquery.stickytableheaders.min.js"></script>
#+HTML_HEAD: <script type="text/javascript" src="js/readtheorg.js"></script>

#+LATEX_CLASS: cleanreport
#+LaTeX_CLASS_OPTIONS: [tocnp, secbreak, minted]
#+LaTeX_HEADER: \usepackage{svg}
#+LaTeX_HEADER: \newcommand{\authorFirstName}{Thomas}
#+LaTeX_HEADER: \newcommand{\authorLastName}{Dehaeze}
#+LaTeX_HEADER: \newcommand{\authorEmail}{dehaeze.thomas@gmail.com}

#+PROPERTY: header-args:matlab  :session *MATLAB*
#+PROPERTY: header-args:matlab+ :comments org
#+PROPERTY: header-args:matlab+ :exports both
#+PROPERTY: header-args:matlab+ :eval no-export
#+PROPERTY: header-args:matlab+ :output-dir figs
#+PROPERTY: header-args:matlab+ :mkdirp yes
:END:

* Identification
#+begin_src matlab :results none :exports none
  <<matlab-init>>
  addpath('src');
  addpath('library');
#+end_src

#+begin_src matlab :results none :exports none
  open stewart
#+end_src

The hexapod structure and Sample structure are initialized.
#+begin_src matlab :results none
  initializeHexapod();
  initializeSample();
#+end_src

#+begin_src matlab :results none
  G = identifyPlant();
#+end_src

* Cartesian Plot
From a force applied in the Cartesian frame to a displacement in the Cartesian frame.
#+begin_src matlab :results none
  figure;
  hold on;
  bode(G.G_cart(1, 1));
  bode(G.G_cart(3, 3));
  hold off;
#+end_src

* From a force to force sensor
#+begin_src matlab :results none
  figure;
  hold on;
  bode(G.G_forc(1, 1));
  bode(G.G_forc(2, 2));
  bode(G.G_forc(3, 3));
  bode(G.G_forc(4, 4));
  bode(G.G_forc(5, 5));
  bode(G.G_forc(6, 6));
  hold off;
#+end_src

#+begin_src matlab :results none
  figure;
  hold on;
  bode(G.G_forc(1, 1));
  bode(G.G_forc(1, 2));
  bode(G.G_forc(1, 3));
  bode(G.G_forc(1, 4));
  bode(G.G_forc(1, 5));
  bode(G.G_forc(1, 6));
  hold off;
#+end_src

* From a force applied in the leg to the displacement of the leg
#+begin_src matlab :results none
  figure;
  hold on;
  bode(G.G_legs(1, 1));
  bode(G.G_legs(2, 2));
  bode(G.G_legs(3, 3));
  bode(G.G_legs(4, 4));
  bode(G.G_legs(5, 5));
  bode(G.G_legs(6, 6));
  hold off;
#+end_src

#+begin_src matlab :results none
  figure;
  hold on;
  bode(G.G_legs(1, 1));
  bode(G.G_legs(1, 2));
  bode(G.G_legs(1, 3));
  bode(G.G_legs(1, 4));
  bode(G.G_legs(1, 5));
  bode(G.G_legs(1, 6));
  hold off;
#+end_src

* Transmissibility
#+begin_src matlab :results none
  figure;
  hold on;
  bode(G.G_tran(1, 1));
  bode(G.G_tran(2, 2));
  bode(G.G_tran(3, 3));
  hold off;
#+end_src

#+begin_src matlab :results none
  figure;
  hold on;
  bode(G.G_tran(4, 4));
  bode(G.G_tran(5, 5));
  bode(G.G_tran(6, 6));
  hold off;
#+end_src

#+begin_src matlab :results none
  figure;
  hold on;
  bode(G.G_tran(1, 1));
  bode(G.G_tran(2, 1));
  bode(G.G_tran(3, 1));
  hold off;
#+end_src

