identification.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-03-22 ven. 12:03 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Identification of the Stewart Platform using Simscape</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Thomas Dehaeze" />
<link rel="stylesheet" type="text/css" href="css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Identification of the Stewart Platform using Simscape</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org0c15748">1. Identification</a></li>
<li><a href="#orgb51bebd">2. Cartesian Plot</a></li>
<li><a href="#org8822347">3. From a force to force sensor</a></li>
<li><a href="#orgb3f97c3">4. From a force applied in the leg to the displacement of the leg</a></li>
<li><a href="#org4f7f749">5. Transmissibility</a></li>
<li><a href="#orgc027ff6">6. Compliance</a></li>
<li><a href="#orgeb43267">7. Inertial</a></li>
<li><a href="#org702dc6c">8. identifyPlant</a></li>
</ul>
</div>
</div>

<div id="outline-container-org0c15748" class="outline-2">
<h2 id="org0c15748"><span class="section-number-2">1</span> Identification</h2>
<div class="outline-text-2" id="text-1">
<p>
The hexapod structure and Sample structure are initialized.
</p>
<div class="org-src-container">
<pre class="src src-matlab">initializeHexapod<span style="color: #DCDCCC;">()</span>;
initializeSample<span style="color: #DCDCCC;">()</span>;
</pre>
</div>

<div class="org-src-container">
<pre class="src src-matlab">G = identifyPlant<span style="color: #DCDCCC;">()</span>;
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb51bebd" class="outline-2">
<h2 id="orgb51bebd"><span class="section-number-2">2</span> Cartesian Plot</h2>
<div class="outline-text-2" id="text-2">
<p>
From a force applied in the Cartesian frame to a displacement in the Cartesian frame.
</p>
<div class="org-src-container">
<pre class="src src-matlab"><span style="color: #7CB8BB;">figure</span>;
hold on;
bode<span style="color: #DCDCCC;">(</span>G.G_cart<span style="color: #BFEBBF;">(</span><span style="color: #BFEBBF;">1</span>, <span style="color: #BFEBBF;">1</span><span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>;
bode<span style="color: #DCDCCC;">(</span>G.G_cart<span style="color: #BFEBBF;">(</span><span style="color: #BFEBBF;">3</span>, <span style="color: #BFEBBF;">3</span><span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>;
hold off;
</pre>
</div>
</div>
</div>

<div id="outline-container-org8822347" class="outline-2">
<h2 id="org8822347"><span class="section-number-2">3</span> From a force to force sensor</h2>
<div class="outline-text-2" id="text-3">
<div class="org-src-container">
<pre class="src src-matlab"><span style="color: #7CB8BB;">figure</span>;
hold on;
bode<span style="color: #DCDCCC;">(</span>G.G_forc<span style="color: #BFEBBF;">(</span><span style="color: #BFEBBF;">1</span>, <span style="color: #BFEBBF;">1</span><span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>;
bode<span style="color: #DCDCCC;">(</span>G.G_forc<span style="color: #BFEBBF;">(</span><span style="color: #BFEBBF;">2</span>, <span style="color: #BFEBBF;">2</span><span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>;
bode<span style="color: #DCDCCC;">(</span>G.G_forc<span style="color: #BFEBBF;">(</span><span style="color: #BFEBBF;">3</span>, <span style="color: #BFEBBF;">3</span><span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>;
bode<span style="color: #DCDCCC;">(</span>G.G_forc<span style="color: #BFEBBF;">(</span><span style="color: #BFEBBF;">4</span>, <span style="color: #BFEBBF;">4</span><span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>;
bode<span style="color: #DCDCCC;">(</span>G.G_forc<span style="color: #BFEBBF;">(</span><span style="color: #BFEBBF;">5</span>, <span style="color: #BFEBBF;">5</span><span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>;
bode<span style="color: #DCDCCC;">(</span>G.G_forc<span style="color: #BFEBBF;">(</span><span style="color: #BFEBBF;">6</span>, <span style="color: #BFEBBF;">6</span><span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>;
hold off;
</pre>
</div>

<div class="org-src-container">
<pre class="src src-matlab"><span style="color: #7CB8BB;">figure</span>;
hold on;
bode<span style="color: #DCDCCC;">(</span>G.G_forc<span style="color: #BFEBBF;">(</span><span style="color: #BFEBBF;">1</span>, <span style="color: #BFEBBF;">1</span><span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>;
bode<span style="color: #DCDCCC;">(</span>G.G_forc<span style="color: #BFEBBF;">(</span><span style="color: #BFEBBF;">1</span>, <span style="color: #BFEBBF;">2</span><span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>;
bode<span style="color: #DCDCCC;">(</span>G.G_forc<span style="color: #BFEBBF;">(</span><span style="color: #BFEBBF;">1</span>, <span style="color: #BFEBBF;">3</span><span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>;
bode<span style="color: #DCDCCC;">(</span>G.G_forc<span style="color: #BFEBBF;">(</span><span style="color: #BFEBBF;">1</span>, <span style="color: #BFEBBF;">4</span><span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>;
bode<span style="color: #DCDCCC;">(</span>G.G_forc<span style="color: #BFEBBF;">(</span><span style="color: #BFEBBF;">1</span>, <span style="color: #BFEBBF;">5</span><span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>;
bode<span style="color: #DCDCCC;">(</span>G.G_forc<span style="color: #BFEBBF;">(</span><span style="color: #BFEBBF;">1</span>, <span style="color: #BFEBBF;">6</span><span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>;
hold off;
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb3f97c3" class="outline-2">
<h2 id="orgb3f97c3"><span class="section-number-2">4</span> From a force applied in the leg to the displacement of the leg</h2>
<div class="outline-text-2" id="text-4">
<div class="org-src-container">
<pre class="src src-matlab"><span style="color: #7CB8BB;">figure</span>;
hold on;
bode<span style="color: #DCDCCC;">(</span>G.G_legs<span style="color: #BFEBBF;">(</span><span style="color: #BFEBBF;">1</span>, <span style="color: #BFEBBF;">1</span><span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>;
bode<span style="color: #DCDCCC;">(</span>G.G_legs<span style="color: #BFEBBF;">(</span><span style="color: #BFEBBF;">2</span>, <span style="color: #BFEBBF;">2</span><span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>;
bode<span style="color: #DCDCCC;">(</span>G.G_legs<span style="color: #BFEBBF;">(</span><span style="color: #BFEBBF;">3</span>, <span style="color: #BFEBBF;">3</span><span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>;
bode<span style="color: #DCDCCC;">(</span>G.G_legs<span style="color: #BFEBBF;">(</span><span style="color: #BFEBBF;">4</span>, <span style="color: #BFEBBF;">4</span><span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>;
bode<span style="color: #DCDCCC;">(</span>G.G_legs<span style="color: #BFEBBF;">(</span><span style="color: #BFEBBF;">5</span>, <span style="color: #BFEBBF;">5</span><span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>;
bode<span style="color: #DCDCCC;">(</span>G.G_legs<span style="color: #BFEBBF;">(</span><span style="color: #BFEBBF;">6</span>, <span style="color: #BFEBBF;">6</span><span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>;
hold off;
</pre>
</div>

<div class="org-src-container">
<pre class="src src-matlab"><span style="color: #7CB8BB;">figure</span>;
hold on;
bode<span style="color: #DCDCCC;">(</span>G.G_legs<span style="color: #BFEBBF;">(</span><span style="color: #BFEBBF;">1</span>, <span style="color: #BFEBBF;">1</span><span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>;
bode<span style="color: #DCDCCC;">(</span>G.G_legs<span style="color: #BFEBBF;">(</span><span style="color: #BFEBBF;">1</span>, <span style="color: #BFEBBF;">2</span><span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>;
bode<span style="color: #DCDCCC;">(</span>G.G_legs<span style="color: #BFEBBF;">(</span><span style="color: #BFEBBF;">1</span>, <span style="color: #BFEBBF;">3</span><span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>;
bode<span style="color: #DCDCCC;">(</span>G.G_legs<span style="color: #BFEBBF;">(</span><span style="color: #BFEBBF;">1</span>, <span style="color: #BFEBBF;">4</span><span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>;
bode<span style="color: #DCDCCC;">(</span>G.G_legs<span style="color: #BFEBBF;">(</span><span style="color: #BFEBBF;">1</span>, <span style="color: #BFEBBF;">5</span><span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>;
bode<span style="color: #DCDCCC;">(</span>G.G_legs<span style="color: #BFEBBF;">(</span><span style="color: #BFEBBF;">1</span>, <span style="color: #BFEBBF;">6</span><span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>;
hold off;
</pre>
</div>
</div>
</div>

<div id="outline-container-org4f7f749" class="outline-2">
<h2 id="org4f7f749"><span class="section-number-2">5</span> Transmissibility</h2>
<div class="outline-text-2" id="text-5">
<div class="org-src-container">
<pre class="src src-matlab"><span style="color: #7CB8BB;">figure</span>;
hold on;
bode<span style="color: #DCDCCC;">(</span>G.G_tran<span style="color: #BFEBBF;">(</span><span style="color: #BFEBBF;">1</span>, <span style="color: #BFEBBF;">1</span><span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>;
bode<span style="color: #DCDCCC;">(</span>G.G_tran<span style="color: #BFEBBF;">(</span><span style="color: #BFEBBF;">2</span>, <span style="color: #BFEBBF;">2</span><span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>;
bode<span style="color: #DCDCCC;">(</span>G.G_tran<span style="color: #BFEBBF;">(</span><span style="color: #BFEBBF;">3</span>, <span style="color: #BFEBBF;">3</span><span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>;
hold off;
</pre>
</div>

<div class="org-src-container">
<pre class="src src-matlab"><span style="color: #7CB8BB;">figure</span>;
hold on;
bode<span style="color: #DCDCCC;">(</span>G.G_tran<span style="color: #BFEBBF;">(</span><span style="color: #BFEBBF;">4</span>, <span style="color: #BFEBBF;">4</span><span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>;
bode<span style="color: #DCDCCC;">(</span>G.G_tran<span style="color: #BFEBBF;">(</span><span style="color: #BFEBBF;">5</span>, <span style="color: #BFEBBF;">5</span><span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>;
bode<span style="color: #DCDCCC;">(</span>G.G_tran<span style="color: #BFEBBF;">(</span><span style="color: #BFEBBF;">6</span>, <span style="color: #BFEBBF;">6</span><span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>;
hold off;
</pre>
</div>

<div class="org-src-container">
<pre class="src src-matlab"><span style="color: #7CB8BB;">figure</span>;
hold on;
bode<span style="color: #DCDCCC;">(</span>G.G_tran<span style="color: #BFEBBF;">(</span><span style="color: #BFEBBF;">1</span>, <span style="color: #BFEBBF;">1</span><span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>;
bode<span style="color: #DCDCCC;">(</span>G.G_tran<span style="color: #BFEBBF;">(</span><span style="color: #BFEBBF;">2</span>, <span style="color: #BFEBBF;">1</span><span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>;
bode<span style="color: #DCDCCC;">(</span>G.G_tran<span style="color: #BFEBBF;">(</span><span style="color: #BFEBBF;">3</span>, <span style="color: #BFEBBF;">1</span><span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>;
hold off;
</pre>
</div>
</div>
</div>
