identification.org
* Compliance
From a force applied in the Cartesian frame to a relative displacement of the mobile platform with respect to the base.

#+begin_src matlab :results none
  figure;
  hold on;
  bode(G.G_comp(1, 1));
  bode(G.G_comp(2, 2));
  bode(G.G_comp(3, 3));
  hold off;
#+end_src

* Inertial
From a force applied on the Cartesian frame to the absolute displacement of the mobile platform.

#+begin_src matlab :results none
  figure;
  hold on;
  bode(G.G_iner(1, 1));
  bode(G.G_iner(2, 2));
  bode(G.G_iner(3, 3));
  hold off;
#+end_src

