identification.html

<div id="outline-container-orgc027ff6" class="outline-2">
<h2 id="orgc027ff6"><span class="section-number-2">6</span> Compliance</h2>
<div class="outline-text-2" id="text-6">
<p>
From a force applied in the Cartesian frame to a relative displacement of the mobile platform with respect to the base.
</p>

<div class="org-src-container">
<pre class="src src-matlab"><span style="color: #7CB8BB;">figure</span>;
hold on;
bode<span style="color: #DCDCCC;">(</span>G.G_comp<span style="color: #BFEBBF;">(</span><span style="color: #BFEBBF;">1</span>, <span style="color: #BFEBBF;">1</span><span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>;
bode<span style="color: #DCDCCC;">(</span>G.G_comp<span style="color: #BFEBBF;">(</span><span style="color: #BFEBBF;">2</span>, <span style="color: #BFEBBF;">2</span><span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>;
bode<span style="color: #DCDCCC;">(</span>G.G_comp<span style="color: #BFEBBF;">(</span><span style="color: #BFEBBF;">3</span>, <span style="color: #BFEBBF;">3</span><span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>;
hold off;
</pre>
</div>
</div>
</div>
